100
# 이렇게 그냥 값만 쓰면 그 값이 자동으로 출력되지 않음. shell 환경에서는 출력됨.

#1. 파이썬의 기본적인 출력기능 print(Data)

# 프로그램을 데이터를 다루는 것임.
#1) 사용자이름, 리뷰글, 게시판 제목 --- 문자열
#2) 나이, 성적, 상품가격 등        --- 숫자
#3) 로그인 여부, 미성년자 여부 등   --- 논리값

# 각각의 데이터유형(자료형 Data type)를 출력해보기.
print(1977)
print(3.14)
print("강중구")
# print(Hello) -- 에러.. why? 문자열 Data는 받드시 따옴표와 함께 써야 함
print("Hello")
#문자열을 쓸때 싱글 따옴표로 써도 됨.
print('Nice')
print(True)
print(3<5)
print(     200     )
print(    'Good!'  )
print("Hello world")
print("Hello      world")
print("      have a good day.@")

print()
# 한 줄을 띄워쓰기를 위한 목적으로 위에 예시처럼 사용한다.
print("aaa")
# data를 써야 하는 자리에.. 연산식(계산식)을 쓰면 식이 출력되는 것이 아니라, 결과 값이 출력 된다.
print(10/5)
print("3*5")
# 문자열 안에 특수문자도 사용 가능함... 단, 사용 못하는 것이 2개가 있다![따옴표를 중복으로 쓰거나 역슬래시$]
print("1977.01.10")
# 큰따옴표가 나오게 하려면.. 작은따옴표의 문자열로 만들면 된다.
print('나는"홍길동" 입니다.')
# 만약, 한 문장안에 큰다옴표와 작은 따옴표를 같이 사용하고 싶다면...[특수한 목적의 문자인 역슬래시 사용]
print("나는 '의적'으로 활동하는 \"홍길동\"입니다.")
# 이 역슬래시 문자는 원래 문자열의 구조에서 벗어난 특수문자여서.. 이를 이스케이프 문자라고 부름.

# 이스케이프 문자의 또 다른 사용법. 줄바꿈을 해 주는 특수문자.
# \n [new line]
print("안녕하세요.\n손님~! 반가워요")
print("Hello\nNice\nGood")
#\t [tab] 탭 간격 벌리기
print("Hello/tNice")
# 여러개의 데이터를 출력하는 기능이 가능함(쉼표(,)로 사용)
print(10,20, 100, 300,    50)
print(1000, "sam", 3.14, True)
print(3+5)
print("3+5=8")
print(3,5,3+5)
print(3, "+", 5, "=", 3+5)
print("질문의 답은", 2+1, '③', "3번", "입니다.")
