print("문자 선택 연산자에 대해 알아볼까요?")
print("안녕하세요"[0])
print("안녕하세요"[1])
print("안녕하세요"[2])
print("안녕하세요"[3])
print("안녕하세요"[4])

print("문자를 뒤에서부터 선택해 볼까요?")
print("안녕하세요"[-1])
print("안녕하세요"[-2])
print("안녕하세요"[-3])
print("안녕하세요"[-4])
print("안녕하세요"[-5])

# [] 연산자를 이용해 문자열의 특정위치에 있는 문자를 참조하는 것(인덱싱)
# [:] 연산자를 이용해 문자열의 일부를 추출하는 것을 "슬라이싱"이라 한다

print("# 연습 문제")
print("\\\\\\\\")
print("-" * 8)

print("안녕하세요"[0])
print("안녕하세요"[1])
print("안녕하세요"[2])
print("안녕하세요"[3])
print("안녕하세요"[4])

print("안녕하세요"[1:3])
print("안녕하세요"[2:4])
print("안녕하세요"[1:])
print("안녕하세요"[:3])
''
''

print("# 기본적인 연산")
print(15, "+", 4, "=", 15 + 4)
print(15, "-", 4, "=", 15 - 4)
print(15, "*", 4, "=", 15 * 4)
print(15, "/", 4, "=", 15 / 4)

print("3462를 17로 나누었을때의")
print("- 몫:", 3462 // 17)
print("- 나머지:", 3462 % 17 )

print(2 + 2 - (2 * 2) / 2 * 2)
print(2 - 2 + (2 / 2) * 2 + 2 )
print()

#변수 선언과 할당
pi = 3.14159265
r = 10

print("원주율=", pi)
print("반지름=", r)
print("원의둘레=", 2 * pi * r)
print("원의 넓이=", pi * r * r)
print()

print("\"안녕하세요.\"라고 말했습니다.")      # \" 이스케이스 문자 사용 
print('\'배가 고픕니다.\'라고 생각 했습니다')  # \' 이스케이프 문자 사용
print()

#여러줄 문자열
print("""동해물과 백두산이 마르고 닳도록
하느님이 보우하사 우리나라 만세
무궁화 삼천리 화려강산 대한사람
대한으로 길이 보전하세""")
print()

print("안녕하세요" * 3)
input("인사말을 입력하세요>")
print(string)

# 변수 선언은 변수를 생성하는 것을 의미하고, 변수 할당은 변수에 값을 넣는 것을 의미한다.
