# 문제1) 입력 받은 두 정수를 나누었을 때 얻게 되는 몫과 나머지를 출력하는 프로그램을 작성(7과 2가 입력되면 몫으로 3, 나머지는 1이 출력)
# a= int(input("첫번째 정수를 입력하세요: "))
# b= int(input("두번째 정수를 입력하세요: "))
# q = a // b
# r = a % b
# print("몫:", q)
# print("나머지:", r)

# 문제2) 사용자로부터 원의 반지름을 입력 받아서 면적을 계산하여 출력하는 프로그램을 작성.
# (단, 원의 반지름(r)은 실수형으로 입력되며 출력도 실수형으로 입력) 
# r= float(input("원의 반지름을 입력하세요:"))
# a = 3.14 * r * r
# print("원의 면적은:", a)
# print()

#문제3) 현재의 원화 환율을 찾아 변수에 저장하고, 달러를 키보드로 입력 받으면 원화로 출력하는 프로그램을 작성.
# 환율 = 1466
# d= float(input("달러금액을 입력하세요: "))
# won= d * 환율
# print("지금의 환율은 얼마일까요: ", won, "원")
# print()

#문제4) 사용자로부터 정수 3개를 입력 받아서 정수 3개의 합,평균을 구해서 출력하는 프로그램 작성(단, 평균은 소수점이하의 숫자 출력)
# a= int(input("첫번째 정수를 입력 하세요: "))
# b= int(input("두번째 정수를 입력 하세요: "))
# c= int(input("세번째 정수를 입력 하세요: "))
# sum= a + b + c
# average= sum / 3
# print("합계:", sum)
# print("평균:", average)
# print()

#문제5) 현재 시간(시, 분, 초)를 각각 정수형 변수에 입력 받아 오늘 00시00분00초를 기준으로 몇 초가 흘렀는지를 계산하는 프로그램을 작성.
# 시간= int(input("현재 시를 입력하세요: "))
# 분= int(input("현재 분을 입력하세요: "))
# 초= int(input("현재 초를 입력하세요: "))
# 합계= (시간 * 3600) + (분 * 60) + 초
# print("지금까지 몇 초가 지났을까요: ", 합계, " 초")

# 문제6) 상점에 가면 우리는 상품에 대한 돈을 내고 영수증을 받는다. 영수증에서는 10% 부가세와 잔돈 등이 인쇄되어 있다. 구입한 상품의 가격과 손님한테 받은
# 금액을 입력하면 부가세와 잔돈을 출력하는 프로그램을 작성.(받은돈: 10000, 상품가격: 7500, 부가세: 750, 잔돈: 1750)
상품가격 = int(input("상품가격을 입력하세요: "))
받은가격= int(input("손님에게 받은 금액을 입력하세요: "))
vat = int(상품가격 * 0.10)
잔돈 = 상품가격 - 받은가격
print("부가세: ", vat, "원" )
print("잔돈: ", 잔돈, "원")

# 문제7) 프로그램을 사용자로부터 두 점의 x, y 좌표를 입력 받아서 두점이 이루는 직사각형의 넓이를 계산하여 출력하는 프로그램을 작성
# 단, 좌,상단의 x, y 좌표 값이 우 하단의 x, y  좌표 값보다 작다고 가정하고, 좌 상단의 좌벼정보를 먼저 입력 받는 형태로 예제를 작성해 보자.
