#문제1) 사용자로부터 문자열을 입력받아 변수 message 라는 변수에 할당하세요. 이 문자열의 길이를 출력하고, 첫번째 문자와 마지막 문자를 출력하는 코드를 작성
# message = input("문자열을 입력하시오: ")
# print("문자열의 길이: ",len(message))
# print("첫번째 문자: ", message[0])
# print("마지막 문자: ", message[-1])

# 문제2) 아래와 같은 문자열을 가진 변수가 있다. 문자열을 소문자(.lower)로 바꾸고, 양쪽 공백(.strip)을 제거하는 코드를 작성.
# whitespace_string = " PYTHON  "
# l = whitespace_string.lower()
# clean_str = l.strip()
# print(clean_str)

# 문제3) 'python is a great language'라는 문자열에 'great'이 포함되어 있는지 확인하는 코드를 작성하시오. 포함되어 있다면 True, 그렇지 않다면 False를 출력.
# text = "python is a great language"
# r = 'great' in text
# print(r) #True

# 문제4) 사용자로부터 전화번호를 입력받아 첫3자리, 두번째 3~4자리, 세번째 4자리 숫자를 따로따로 입력 받아서 하나의 문자열로 합쳐서 저장하고 출력하시오. 단, 사이에 '-'로 구분자를 갖도록 한다.
# 사용자1 = input("첫3자리 입력: ")
# 사용자2 = input("두번째 3~4자리 입력: ")
# 사용자3 = input("마지막 4자리 입력: ")
# 핸드폰번호 = 사용자1 + "-" + 사용자2 + "-" + 사용자3
# print("사용자 번호: ", 핸드폰번호 )

# 문제5) 사용자로부터 이메일주소를 입력받아라. 단, 메일주소는 @을 포함하여 메일서버주소까지 모두 입력받아야 함. 입력 받은 메일주소에서 @ 앞에 있는 개인메일이름과 @ 뒤에 있는
# 메일서버주소를 각각 분리하여 저장하고 출력하시오(학습이 진행되지 않는 list문법이 일부 포함 됨)
# email = input("이메일주소를 입력 하세요: ")
# 사용자메일주소, 도메인주소 = email.split("@")
# print("개인 메일이름: ", 사용자메일주소)
# print("메일 서버주소: ", 도메인주소)

#문제6) 아래는 대통령의 신년 기자회견 메시지입니다.
# message =''' 올해 신년 기자회견에서 저는 AI 연구와 AI 산업이 국가 경쟁력을 좌우할 것이라고 말씀드립니다.
# 정부는 공공 서비스에 ai를 적극 도입해 행정 효율성을 높일 계획입니다.
# 특히 의료AI 분야와 재난 대응 AI 시스템은 국민 안전을 지키는 데 중요한 역할을 할 것입니다.
# 교육 영역에서는 ai 기반 맞춤형 학습과 AI 튜터링 서비스를 확대하겠습니다. 중소기업의 생산성을 높이기 위해 AI 자동화와 AI 데이터 분석 지원 사업을 강화합니다. 산업 전반의 데이터·AI 생태계를 정비해 혁신 기반을 구축하겠습니다.
# 국방 분야에서도 ai 기술을 활용해 보다 정교한 위협 대응 체계를 마련하겠습니다. 또한 교통·에너지 관리에 AI 예측 모델을 적용해 효율성을 높이겠습니다.
# 정부는 AI 윤리 기준과 AI 안전 규범을 마련해 기술 발전이 책임 있게 이루어지도록 하겠습니다.
# 끝으로, ai 혁신이 모두에게 혜택이 될 수 있도록 포용적 성장을 이루겠습니다. '''

# # 1번 문자열 앞뒤 공백 제외한 총 글자 수
# total_text = len(message.strip())
# print("총글자수 (앞뒤 공백 제외): ", total_text)
# print()

# # 2번 띄어쓰기와 줄바꿈 제거 후 글자 수
# no_space_message = message.replace(" ", "").replace("\n", "")
# chars_no_space = len(no_space_message)
# print("띄워쓰기.줄바꿈 제외 글자수: ", chars_no_space)
# print()

# # 3번 'AI' 등장 횟수(대소문자 구분 없이)
# AI_count = message.lower().count("ai")
# print("'AI' 등장횟수: ", AI_count)
# print()




